```digitalocean_firewall.main: Refreshing state... [id=83dc9b06-d529-4fba-9b20-9c425fd474cd]
data.aws_ami.centos_arm64: Reading...
data.aws_ami.centos_x86: Reading...
aws_dynamodb_table.tf-state-lock: Refreshing state... [id=tf-state-lock]
aws_s3_bucket.tf-management-trail: Refreshing state... [id=tf-management-trail]
aws_s3_bucket.tf-backend: Refreshing state... [id=tf-backend-abhishek]
aws_iam_role.dev_instance_role: Refreshing state... [id=dev_instance_role]
aws_security_group.main: Refreshing state... [id=sg-06aba332b2d3d09ea]
aws_kms_key.encryption_key: Refreshing state... [id=ccd23c99-9272-49bb-a20e-04b223695683]
data.aws_ami.centos_x86: Read complete after 0s [id=ami-076e12ce8d7390d90]
data.aws_ami.centos_arm64: Read complete after 0s [id=ami-0f73c69bbec13afb1]
aws_s3_bucket_public_access_block.tf-backend-public-access-block: Refreshing state... [id=tf-backend-abhishek]
aws_s3_bucket_policy.tf-backend-policy: Refreshing state... [id=tf-backend-abhishek]
aws_s3_bucket_policy.tf-management-trail-policy: Refreshing state... [id=tf-management-trail]
aws_s3_bucket_logging.tf-backend-logging: Refreshing state... [id=tf-management-trail]
aws_cloudtrail.management[0]: Refreshing state... [id=tf-trail-management]
aws_iam_role_policy_attachment.s3_policy_attachment: Refreshing state... [id=dev_instance_role-20210925181828891000000001]
aws_iam_instance_profile.dev_instance_profile: Refreshing state... [id=test_profile]
aws_iam_role_policy_attachment.secrets_manager_policy_attachment: Refreshing state... [id=dev_instance_role-20210925181828900900000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.dev_instance_role will be updated in-place
  ~ resource "aws_iam_role" "dev_instance_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo: <aws-samples/EXAMPLEREPO>:ref:refs/heads/<ExampleBranch>"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "dev_instance_role"
        name                  = "dev_instance_role"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.github_oidc_role will be created
  + resource "aws_iam_role" "github_oidc_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::408911611184:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github_oidc_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_s3_bucket_logging.tf-backend-logging will be created
  + resource "aws_s3_bucket_logging" "tf-backend-logging" {
      + bucket        = "tf-management-trail"
      + id            = (known after apply)
      + target_bucket = "tf-backend-abhishek"
      + target_prefix = "log/"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: CURRENTPLAN.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "CURRENTPLAN.tfplan"
```